/**
 * Apple门店配置文件
 * 按省份分类的Apple门店信息
 */

// 默认查询门店编号（浦东店）
const defaultStore = 'R645';

// 门店信息对象，按省份分类
const stores = {
  "上海": {
    "R705": {
      "name": "七宝"
    },
    "R401": {
      "name": "上海环贸 iapm "
    },
    "R581": {
      "name": "五角场"
    },
    "R359": {
      "name": "南京东路"
    },
    "R389": {
      "name": "浦东"
    },
    "R683": {
      "name": "环球港"
    },
    "R390": {
      "name": "香港广场"
    }
  },
  "北京": {
    "R320": {
      "name": "三里屯"
    },
    "R479": {
      "name": "华贸购物中心"
    },
    "R645": {
      "name": "朝阳大悦城"
    },
    "R448": {
      "name": "王府井"
    },
    "R388": {
      "name": "西单大悦城"
    }
  },
  "云南": {
    "R670": {
      "name": "昆明"
    }
  },
  "四川": {
    "R502": {
      "name": "成都万象城"
    },
    "R580": {
      "name": "成都太古里"
    }
  },
  "天津": {
    "R638": {
      "name": "天津万象城"
    },
    "R637": {
      "name": "天津大悦城"
    },
    "R579": {
      "name": "天津恒隆广场"
    }
  },
  "山东": {
    "R648": {
      "name": "济南恒隆广场"
    },
    "R557": {
      "name": "青岛万象城"
    }
  },
  "广东": {
    "R577": {
      "name": "天环广场 "
    },
    "R639": {
      "name": "珠江新城"
    },
    "R484": {
      "name": "深圳益田假日广场"
    }
  },
  "广西": {
    "R571": {
      "name": "南宁万象城"
    }
  },
  "江苏": {
    "R493": {
      "name": "南京艾尚天地"
    },
    "R703": {
      "name": "玄武湖"
    },
    "R643": {
      "name": "虹悦城"
    },
    "R574": {
      "name": "无锡恒隆广场"
    },
    "R688": {
      "name": "苏州"
    }
  },
  "河南": {
    "R572": {
      "name": "郑州万象城"
    }
  },
  "浙江": {
    "R531": {
      "name": "天一广场"
    },
    "R532": {
      "name": "杭州万象城"
    },
    "R471": {
      "name": "西湖"
    }
  },
  "福建": {
    "R644": {
      "name": "厦门新生活广场"
    },
    "R646": {
      "name": "泰禾广场"
    }
  },
  "辽宁": {
    "R609": {
      "name": "大连恒隆广场"
    },
    "R478": {
      "name": "百年城"
    },
    "R534": {
      "name": "中街大悦城"
    },
    "R576": {
      "name": "沈阳万象城"
    }
  },
  "重庆": {
    "R480": {
      "name": "解放碑"
    },
    "R573": {
      "name": "重庆万象城"
    },
    "R476": {
      "name": "重庆北城天街"
    }
  }
};

module.exports = { defaultStore, stores };